Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/atdf/PIC32CZ8110CA90144S1.atdf
        <register name="INTENCLR" offset="0x8" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Clear" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Clear" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0xC" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Set" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Set" mask="0x2"/>
        </register>
        <register name="INTSTA" offset="0x10" rw="RW" size="4" atomic-op="clear:INTSTA" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="SERR" caption="Single Bit Error" mask="0x1"/>
          <bitfield name="DERR" caption="Double Bit Error" mask="0x2"/>
        </register>
        <register name="FLTCTRL" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Fault Injection Control Register">
          <bitfield name="FLTEN" caption="Fault Injection Enabled" mask="0x2" values="FLTCTRL__FLTEN"/>
          <bitfield name="FLTMD" caption="Fault Injection Mode" mask="0x3000"/>
        </register>
        <register name="FLTPTR" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Fault Injection Pointer Register">
          <bitfield name="FLT1PTR" caption="Single Fault Injection Bit Pointer" mask="0xFF"/>
          <bitfield name="FLT2PTR" caption="Double Fault Injection Bit Pointer" mask="0xFF0000"/>
        </register>
        <register name="FLTADR" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Fault Injection Address Register">
          <bitfield name="FLTADR" caption="Fault Address Offset" mask="0xFFFFFF"/>
        </register>
        <register name="ERRCADR" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Error Capture Address Register">
          <bitfield name="ERCADR" caption="ECC SECDED Error Capture Address" mask="0xFFFFFF"/>
        </register>
        <register name="ERRCPAR" offset="0x24" rw="R" size="4" initval="0x00000000" caption="Error Capture Parity Register">
          <bitfield name="ERCPAR" caption="ECC SECDED Error Capture Parity" mask="0xFF"/>
        </register>
        <register name="ERRCSYN" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Error Capture Syndrome Register">
          <bitfield name="ERCSYN" caption="ECC SECDED Error Capture Syndrome" mask="0xFF" values="ERRCSYN__ERCSYN"/>
          <bitfield name="ERR1" caption="ECC Single Bit Error" mask="0x4000"/>
          <bitfield name="ERR2" caption="ECC Double Bit Error" mask="0x8000" values="ERRCSYN__ERR2"/>
        </register>
      </register-group>
      <value-group name="CTRLA__SWRST">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Reset the MCRAMC. A software-triggered hardware reset of the MCRAMC user interface is performed." value="1"/>
      </value-group>
      <value-group name="CTRLA__ENABLE">
        <value name="0" caption="ECC decoding is disabled." value="0"/>
        <value name="1" caption="ECC decoding is enabled." value="1"/>
      </value-group>
      <value-group name="FLTCTRL__FLTEN">
        <value name="0" caption="Disables fault injection." value="0"/>
        <value name="1" caption="Enables fault injection at FLTADR address offset as selected by FLTMD and FLTxPTR." value="1"/>
      </value-group>
      <value-group name="ERRCSYN__ERCSYN">
        <value name="0" caption="Not a Single bit error." value="0"/>
        <value name="1" caption="Single bit error." value="1"/>
      </value-group>
      <value-group name="ERRCSYN__ERR2">
        <value name="0" caption="Not a Double bit error." value="0"/>
        <value name="1" caption="Double bit error." value="1"/>
      </value-group>
    </module>
    <module name="NVIC" id="SYSTEM_IP" version="1.0.0" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register name="ISER" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Set Enable Register">
          <bitfield name="SETENA" caption="Interrupt set enable bits" mask="0x7"/>
        </register>
        <register name="ICER" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Enable Register">
          <bitfield name="CLRENA" caption="Interrupt clear-enable bits" mask="0x7"/>
        </register>
        <register name="ISPR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Set Pending Register">
          <bitfield name="SETPEND" caption="Interrupt set-pending bits" mask="0x7"/>
        </register>
        <register name="ICPR" offset="0x180" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Pending Register">
          <bitfield name="CLRPEND" caption="Interrupt clear-pending bits" mask="0x7"/>
        </register>
        <register name="IPR" offset="0x300" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Priority Register n">
          <bitfield name="PRI0" caption="Priority of interrupt n" mask="0x3"/>
          <bitfield name="PRI1" caption="Priority of interrupt n" mask="0x300"/>
          <bitfield name="PRI2" caption="Priority of interrupt n" mask="0x30000"/>
          <bitfield name="PRI3" caption="Priority of interrupt n" mask="0x3000000"/>
        </register>
      </register-group>
    </module>
    <module name="PKRAM" id="DOS03785" name2="DOS03785" version="1a0" caption="PKRAM Module">
      <register-group name="PKRAM" caption="PKRAM Module">
        <register name="PKRPCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Parity Control">
          <bitfield name="PARITY" caption="RAM Parity Enable bit (1)" mask="0x1"/>
          <bitfield name="FLTEN" caption="Fault Injection Enable bit" mask="0x2"/>
          <bitfield name="FLTPTR" caption="Fault Injection Bit Pointer bit" mask="0x7F00"/>
        </register>
        <register name="PKRPERROR" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Parity Error">
          <bitfield name="PARITY" caption="PK RAM Parity Error bit" mask="0x1"/>
        </register>
      </register-group>
    </module>
    <module name="RTC" version="1.0.0" caption="Real Time Clock Module">
      <register-group name="RTC" caption="Real Time Clock Module">
        <register name="CNTL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Lower Count">
          <bitfield name="CNTL" caption="RTC Lower Counter Register" mask="0xFFFE0000"/>
        </register>
        <register name="CNTH" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Upper  Count">
          <bitfield name="CNTH" caption="RTC Upper Counter Register" mask="0xFFFFFFFF"/>
        </register>
        <register name="MATCHL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Lower Match">
          <bitfield name="MATCHL" caption="RTC Match Register" mask="0xFFFE0000"/>
        </register>
